{
    "intents": [
        {
            "tag": "saludo",
            "patterns": ["hola", "qué tal", "cómo estás", "saludos"],
            "responses": ["¡Hola! ¿Cómo puedo ayudarte hoy?", "¡Hola! ¿En qué puedo asistirte?", "¡Hola! ¿Qué tal tu día?"]
        },
        {
            "tag": "nombre",
            "patterns": ["¿cuál es tu nombre?", "cómo te llamas", "cuántos años tienes"],
            "responses": ["Me llamo Miguel. ¿Y tú?", "Soy un chatbot creado para ayudarte. ¿Cómo te llamas?", "No tengo edad, soy un programa de computadora."]
        },
        {
            "tag": "despedida",
            "patterns": ["adiós", "hasta luego", "nos vemos", "chau"],
            "responses": ["¡Adiós! Que tengas un buen día.", "¡Hasta luego! Espero hablar contigo pronto.", "¡Cuídate! Nos vemos en otra ocasión."]
        },
        {
            "tag": "agradecimiento",
            "patterns": ["gracias", "te lo agradezco", "muchas gracias"],
            "responses": ["¡De nada! Estoy aquí para ayudarte.", "¡Un placer asistirte!", "¡No hay de qué! Si necesitas algo más, aquí estoy."]
        },
        {
            "tag": "informacion",
            "patterns": ["cuéntame sobre ti", "¿qué puedes hacer?", "¿cómo funcionas?"],
            "responses": ["Soy un chatbot diseñado para ayudarte con tus preguntas y mantener una conversación.", "Puedo responder a tus preguntas y aprender de nuestras conversaciones.", "Estoy aquí para asistirte en lo que necesites, desde información general hasta soporte."]
        },
        {
            "tag": "clima",
            "patterns": ["¿cómo está el clima?", "¿qué tiempo hace hoy?", "cuéntame sobre el clima"],
            "responses": ["Lo siento, no puedo verificar el clima en este momento. ¿Hay algo más en lo que pueda ayudarte?", "No tengo acceso a información meteorológica. ¿Cómo puedo asistirte en otra cosa?"]
        },
        {
            "tag": "horario",
            "patterns": ["¿qué hora es?", "¿me puedes decir la hora?", "¿qué hora tienes?"],
            "responses": ["Lo siento, no tengo acceso a la hora actual. ¿Hay algo más en lo que pueda ayudarte?", "No puedo decirte la hora. ¿Te puedo ayudar con algo más?"]
        },
        {
            "tag": "jokes",
            "patterns": ["cuéntame un chiste", "dime un chiste", "¿tienes algún chiste?"],
            "responses": ["¿Por qué los pájaros no usan Facebook? Porque ya tienen Twitter.", "¿Qué hace una abeja en el gimnasio? ¡Zum-ba!"]
        },
        {
            "tag": "noticias",
            "patterns": ["cuéntame las noticias", "¿qué está pasando en el mundo?", "dame noticias recientes"],
            "responses": ["Lo siento, no puedo proporcionar noticias actuales. ¿Hay algo más en lo que pueda ayudarte?", "No tengo acceso a noticias en tiempo real. ¿Cómo puedo asistirte con otra cosa?"]
        },
        {
            "tag": "recetas",
            "patterns": ["¿puedes darme una receta?", "dame una receta de cocina", "¿cómo se hace una pizza?"],
            "responses": ["Claro, aquí tienes una receta fácil de pizza: Mezcla 2 tazas de harina, 1 taza de agua, 1 cucharada de levadura y una pizca de sal. Amasa, deja reposar 1 hora, extiende la masa, añade tus ingredientes favoritos y hornea a 220°C por 15-20 minutos.", "¿Qué tipo de receta te gustaría? ¿Algo dulce o salado?"]
        },
        {
            "tag": "consejos",
            "patterns": ["dame un consejo", "¿tienes algún consejo para mí?", "recomiéndame algo"],
            "responses": ["Siempre es bueno leer más libros. La lectura puede abrirte a nuevas perspectivas y conocimientos.", "No olvides tomar un momento para relajarte y cuidar de tu salud mental."]
        },
        {
            "tag": "tecnologia",
            "patterns": ["háblame de tecnología", "¿qué es la inteligencia artificial?", "¿qué novedades hay en tecnología?"],
            "responses": ["La inteligencia artificial es un campo de la informática que se enfoca en crear sistemas capaces de realizar tareas que normalmente requieren inteligencia humana.", "En tecnología, algunas de las últimas novedades incluyen avances en inteligencia artificial, computación cuántica y nuevas innovaciones en dispositivos móviles."]
        },
        {
            "tag": "cine",
            "patterns": ["¿qué películas me recomiendas?", "háblame de una película popular", "dime algo sobre cine"],
            "responses": ["Te recomiendo ver 'Inception', una película de ciencia ficción con una trama fascinante y efectos visuales impresionantes.", "Una película popular en este momento es 'The Marvels'. ¿Te interesa algún género en particular?"]
        },
        {
            "tag": "salud",
            "patterns": ["¿cómo puedo llevar una vida más saludable?", "dame consejos de salud", "¿qué alimentos son buenos para la salud?"],
            "responses": ["Para llevar una vida saludable, asegúrate de comer una dieta equilibrada, hacer ejercicio regularmente y dormir bien. ¿Necesitas más consejos sobre salud específica?", "Incorporar frutas y verduras frescas a tu dieta es esencial para una buena salud. Además, beber suficiente agua y hacer ejercicio regularmente también es muy beneficioso."]
        },
        {
            "tag": "viajes",
            "patterns": ["¿cuáles son los mejores destinos para visitar?", "dame consejos para viajar", "¿qué necesito saber antes de viajar?"],
            "responses": ["Algunos destinos populares incluyen París, Tokio y Nueva York. Depende de tus intereses, ¿qué tipo de viaje te gustaría?", "Antes de viajar, asegúrate de revisar los requisitos de visa, el clima del lugar y las recomendaciones de seguridad. También es útil conocer un poco sobre la cultura local."]
        },
        {
            "tag": "musica",
            "patterns": ["¿qué música me recomiendas?", "dime sobre un artista popular", "¿qué géneros musicales conoces?"],
            "responses": ["Te recomiendo escuchar a Ed Sheeran, que tiene una gran variedad de canciones populares. ¿Prefieres algún género en particular?", "Conozco varios géneros musicales como pop, rock, jazz, y música clásica. ¿Cuál te interesa más?"]
        },
        {
            "tag": "libros",
            "patterns": ["¿qué libro me recomiendas?", "dime sobre un autor famoso", "¿qué libros son populares ahora?"],
            "responses": ["Te recomiendo 'Cien años de soledad' de Gabriel García Márquez, un clásico de la literatura. ¿Tienes algún género que prefieras?", "Autores como J.K. Rowling y George R.R. Martin son muy populares. También puedes explorar las listas de bestsellers para encontrar libros interesantes."]
        },
        {
            "tag": "deportes",
            "patterns": ["¿cuál es tu deporte favorito?", "dime sobre un equipo famoso", "¿qué deportes son populares?"],
            "responses": ["El fútbol es uno de los deportes más populares en el mundo. ¿Hay algún deporte específico que te interese?", "Equipos como el Real Madrid y los Chicago Bulls tienen mucha fama. ¿Te gustaría saber más sobre algún deporte en particular?"]
        },
        {
            "tag": "tecnologia_avanzada",
            "patterns": ["¿qué es la computación cuántica?", "dime sobre las últimas innovaciones tecnológicas", "¿cómo funciona el aprendizaje automático?"],
            "responses": ["La computación cuántica es un área emergente que utiliza principios de la mecánica cuántica para procesar información. Es muy avanzada y prometedora.", "Las últimas innovaciones tecnológicas incluyen avances en inteligencia artificial, realidad aumentada y computación cuántica.", "El aprendizaje automático es una rama de la inteligencia artificial que permite a las máquinas aprender de datos y mejorar con el tiempo sin ser programadas explícitamente."]
        },
        {
            "tag": "finanzas",
            "patterns": ["¿cómo puedo ahorrar dinero?", "dame consejos sobre inversiones", "¿qué es la criptomoneda?"],
            "responses": ["Para ahorrar dinero, es útil hacer un presupuesto y reducir gastos innecesarios. También considera invertir en un fondo de ahorros.", "Invertir en acciones, bonos o bienes raíces son opciones populares. Es importante hacer una investigación y consultar con un asesor financiero.", "La criptomoneda es una forma de moneda digital que utiliza criptografía para asegurar transacciones y controlar la creación de nuevas unidades."]
        },   {
            "tag": "impuestos",
            "patterns": ["¿Cómo puedo declarar mis impuestos?", "Dame consejos para pagar menos impuestos", "¿Qué es el impuesto sobre la renta?"],
            "responses": ["Para declarar tus impuestos, asegúrate de recopilar todos los documentos necesarios y consulta con un contador si es necesario.", "Puedes reducir tus impuestos aprovechando deducciones y créditos fiscales disponibles. Es recomendable consultar a un profesional.", "El impuesto sobre la renta es un impuesto que los gobiernos imponen sobre los ingresos generados por individuos y empresas."]
        },
        {
            "tag": "presupuesto",
            "patterns": ["¿Cómo hago un presupuesto?", "Dame consejos para manejar mi dinero", "¿Qué es un presupuesto personal?"],
            "responses": ["Para hacer un presupuesto, comienza por listar todos tus ingresos y gastos. Luego, ajusta tus gastos para que no excedan tus ingresos.", "Manejar tu dinero de manera efectiva implica controlar tus gastos, ahorrar regularmente, y evitar deudas innecesarias.", "Un presupuesto personal es un plan que detalla cómo planeas gastar tu dinero, asegurando que puedas cubrir todas tus necesidades financieras."]
        },
        {
            "tag": "crédito",
            "patterns": ["¿Qué es una tarjeta de crédito?", "Dame consejos para mejorar mi puntaje crediticio", "¿Cómo funciona un préstamo?"],
            "responses": ["Una tarjeta de crédito es una herramienta financiera que te permite pedir dinero prestado hasta un límite preaprobado para realizar compras.", "Para mejorar tu puntaje crediticio, paga tus deudas a tiempo, reduce tus saldos pendientes, y evita solicitar múltiples líneas de crédito.", "Un préstamo es una cantidad de dinero que un banco o prestamista te proporciona, y que deberás devolver con intereses en un plazo determinado."]
        },
        {
            "tag": "inversiones",
            "patterns": ["¿Cómo puedo invertir mi dinero?", "Dame opciones de inversión seguras", "¿Qué es una acción?"],
            "responses": ["Puedes invertir tu dinero en acciones, bonos, bienes raíces o fondos mutuos. Considera tu tolerancia al riesgo antes de invertir.", "Las inversiones seguras incluyen bonos del gobierno, cuentas de ahorro de alto rendimiento, y certificados de depósito.", "Una acción es una unidad de propiedad en una empresa que te da derecho a una parte de sus ganancias y activos."]
        },

    {
        "tag": "fútbol",
        "patterns": ["¿Quién es el mejor jugador de fútbol?", "Dime sobre el Mundial de Fútbol", "¿Qué ligas de fútbol son famosas?"],
        "responses": ["Lionel Messi y Cristiano Ronaldo son considerados dos de los mejores jugadores de fútbol de todos los tiempos.", "El Mundial de Fútbol es el torneo más prestigioso de este deporte, celebrado cada cuatro años.", "Ligas como la Premier League, La Liga y la Serie A son algunas de las más famosas en el mundo del fútbol."]
    },
    {
        "tag": "baloncesto",
        "patterns": ["¿Qué es la NBA?", "¿Quién es Michael Jordan?", "Dime sobre los equipos de baloncesto famosos"],
        "responses": ["La NBA es la liga de baloncesto profesional más importante de Estados Unidos y una de las más reconocidas a nivel mundial.", "Michael Jordan es considerado por muchos como el mejor jugador de baloncesto de la historia, con seis campeonatos de la NBA.", "Los Chicago Bulls y Los Angeles Lakers son dos de los equipos más famosos en la historia del baloncesto."]
    },
    {
        "tag": "tenis",
        "patterns": ["¿Quiénes son los mejores tenistas?", "Dime sobre los torneos de Grand Slam", "¿Qué es el tenis?"],
        "responses": ["Roger Federer, Rafael Nadal y Serena Williams son algunos de los mejores tenistas de la historia.", "Los torneos de Grand Slam, como Wimbledon y el Abierto de Estados Unidos, son los eventos más importantes en el mundo del tenis.", "El tenis es un deporte de raqueta que se juega entre dos jugadores (individuales) o dos parejas (dobles) en una cancha rectangular."]
    },
    {
        "tag": "béisbol",
        "patterns": ["¿Qué es la MLB?", "Dime sobre los Yankees de Nueva York", "¿Cómo se juega el béisbol?"],
        "responses": ["La MLB, o Major League Baseball, es la liga de béisbol profesional más importante de Estados Unidos.", "Los Yankees de Nueva York son uno de los equipos más exitosos y reconocidos en la historia del béisbol.", "El béisbol es un deporte que se juega entre dos equipos de nueve jugadores cada uno, donde el objetivo es anotar carreras golpeando una pelota con un bate."]
    }, {
        "tag": "programación",
        "patterns": ["¿Qué es la programación?", "Dime sobre los lenguajes de programación", "¿Cómo puedo aprender a programar?"],
        "responses": ["La programación es el proceso de crear instrucciones que una computadora puede seguir para realizar tareas específicas.", "Algunos de los lenguajes de programación más populares incluyen Python, JavaScript, Java y C++.", "Puedes aprender a programar tomando cursos en línea, practicando con proyectos y utilizando recursos como documentación y tutoriales."]
    },
    {
        "tag": "ciberseguridad",
        "patterns": ["¿Qué es la ciberseguridad?", "Dame consejos para proteger mi información en línea", "¿Qué son los ataques cibernéticos?"],
        "responses": ["La ciberseguridad se refiere a las prácticas diseñadas para proteger redes, dispositivos y datos de ataques y accesos no autorizados.", "Para proteger tu información en línea, utiliza contraseñas seguras, habilita la autenticación de dos factores y evita hacer clic en enlaces sospechosos.", "Los ataques cibernéticos son intentos maliciosos de acceder, dañar o alterar datos y sistemas. Ejemplos incluyen phishing, malware y ransomware."]
    },
    {
        "tag": "internet de las cosas (IoT)",
        "patterns": ["¿Qué es el Internet de las Cosas?", "Dime sobre dispositivos inteligentes", "¿Cómo funciona el IoT?"],
        "responses": ["El Internet de las Cosas (IoT) se refiere a la interconexión de dispositivos físicos que pueden recopilar y compartir datos a través de internet.", "Dispositivos como termostatos inteligentes, cámaras de seguridad y electrodomésticos conectados son ejemplos de IoT.", "El IoT funciona mediante la conexión de dispositivos a internet, lo que les permite comunicarse entre sí y con otros sistemas para automatizar tareas y mejorar la eficiencia."]
    },
    {
        "tag": "computación en la nube",
        "patterns": ["¿Qué es la computación en la nube?", "Dime sobre servicios en la nube", "¿Cómo funciona la nube?"],
        "responses": ["La computación en la nube es la entrega de servicios informáticos, como almacenamiento y procesamiento, a través de internet.", "Servicios como Amazon Web Services (AWS), Microsoft Azure y Google Cloud ofrecen plataformas en la nube para almacenamiento, análisis de datos y desarrollo de aplicaciones.", "La nube funciona al permitir que los usuarios accedan a recursos y aplicaciones a través de internet, sin necesidad de infraestructura física propia."]
    }



    ]
}
